[frmMain]
mnuLanguage.Caption=Idiomas(Language)

pmnuExitTheSystem.Caption=Sistema de salida

mnuSystemSettings.Caption=Configuración del sistema
mnuParameterSetting.Caption=Preferencias de parámetro
mnuBootUp.Caption=Arranca.
mnuExitTheSystem.Caption=Sistema de salida

mnuReportTools.Caption=Instrumentos de presentación
mnuReportDesign.Caption=Diseño de informes

mnuPrintLog.Caption=Ver registro de impresiÃ³n


mnuJsonTools.Caption=Herramienta de análisis json(bejson.com)
mnuBase64.Caption=Base 64 y conversión de imágenes
mnuUrlEncode.Caption=Codificación / decodificación URL
mnuSSLTools.Caption=Instrumento de conversión del certificado SSL
mnuOpenTheRootDirectory.Caption=Abrir directorio raíz
mnuOpenReportDirectory.Caption=Abrir lista de Estados
mnuOpenLogDirectory.Caption=Abrir directorio de registro
mnuOpenTheOutputfileDirectory.Caption=Abrir archivo de salida
mnuWindowDisplay.Caption=Visualización de ventanas
mnuHttpPrint.Caption=Impresión de HTTP
mnuMqttPrint.Caption=Imprimir mqtt
mnuCamera.Caption=Cámara
mnuIdCard.Caption=Documento de identidad
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=Ayuda del sistema
mnuAboutUs.Caption=Sobre nosotros.

ts_http_print.Caption=Impresión de HTTP
lblPort.Caption=Puerto
rb_print.Caption=Imprimir
rb_Preview.Caption=Previsualización
ButtonStart.Caption=Iniciar
ButtonStop.Caption=Stop

ts_mqtt_print.Caption=Imprimir mqtt
gb_mqtt.Caption=Servidor mqtt
lbl_mqtt_server_address.Caption=Dirección
lbl_mqtt_server_port.Caption=Puerto
lbl_mqtt_server_username.Caption=Nombre de usuario
lbl_mqtt_server_userpwd.Caption=Contraseña
lbl_mqtt_server_subscribe_topic.Caption=Tema de suscripción
lbl_mqtt_server_print_verification_code.Caption=Imprimir código
ButtonStart_mqtt.Caption=Iniciar
ButtonStop_mqtt.Caption=Stop

ts_camera.Caption=Cámara
lbl_camera_device_list.Caption=Lista de dispositivos
lbl_camera_resolution.Caption=Resolución
btn_open_camera.Caption=Enciende la Cámara
btn_close_camera.Caption=Apaga la Cámara
chk_auto_open_camera.Caption=Enciende la Cámara.
chk_pal_b.Caption=Pantalla parabólica
chk_auto_top.Caption=El formulario está en la parte superior (siempre al frente)

ts_idcard.Caption=Documento de identidad
lbl_idcard_name.Caption=Nombre
lbl_idcard_sex.Caption=Género
lbl_idcard_nation.Caption=Nacionalidad
lbl_idcard_birthday.Caption=Fecha de nacimiento
lbl_idcard_id.Caption=Número de identificación
lbl_idcard_org.Caption=Autoridad expedidora
lbl_idcard_addr.Caption=Domicilio
lbl_idcard_begin.Caption=Inicio del período de validez
lbl_idcard_end.Caption=Fin del período
lbl_idcard_type.Caption=Tipo de dispositivo
btn_idcard_read.Caption=Leer
lbl_idcard_msg.Caption=Pista de mensaje:

[frmAbout]
btnOk.Caption=Determinación
Caption=Sobre

[LanguageString]
ini_NeedRegister=Imprimir demasiado, reiniciar el enchufe de impresión o comprar la versión OAM.
ini_NoToken=No vale la pena.
ini_ReadIdCardError=¡La tarjeta de lectura fracasó!
ini_GetPrinterList=Obtener lista de impresoras
ini_CreateDir=Crear directorio
ini_FailPleaseCheck=Falló. Compruebe.
ini_PrintFailPleaseCheck=Fallo de impresión. Compruebe.
ini_ReportFileNotExist=Documento de Estado no disponible
ini_DownLoadError=Error al descargar
ini_JsonFormatError=Json tiene un formato incorrecto.
ini_PrintingTimeoutPleaseCheck=Tiempo extra de impresión
ini_PictureFormatError=Formato de imagen incorrecto
ini_PdfFileNotExist=PDF el archivo no existe
ini_PicFileNotExist=Archivo de PIC no existe
ini_This=Que
ini_NotSupport=Negativo.
ini_InterfaceCallFailed=Error de llamada
ini_CameraNotActivated=Cámara no activada.
ini_SelectFolder=Seleccionar carpeta
ini_MinutesMustBeAnInteger=Los minutos deben ser enteros.
ini_MinutesMustBeGreaterThanZero=Los minutos deben ser más que cero.
ini_SelfStartingClientNameCannotBeEmpty=El nombre del cliente desde el inicio no puede estar vacío


ini_PdfFileCannotOpen=Archivo PDF no abierto
ini_LicenseKeyInvalid=Clave de licencia no válida


ini_PicFileCannotOpen=Archivo de selección
ini_UnableInitializePrinter=Impresora no iniciada
ini_PicPrint=Imprimir impresión
ini_PaperSize=Tamaño del papel
ini_CustomMM=Definición(MM)
ini_Width=Anchura
ini_Height=Altura
ini_PrintingDirection=Dirección de impresión
ini_landscape=Horizontal
ini_portrait=Vertical
ini_MarginMM=Distancia de página(MM)
ini_Left=Izquierda
ini_Right=Derecha
ini_Top=En
ini_Bottom=Bajo
ini_Center=Media
ini_VerticalPos=Posición vertical
ini_HorizontalPos=Posición horizontal
ini_Copys=Número de ejemplares
ini_DocumentTitle=Título del documento
ini_PrinterName=Nombre de la impresora
ini_PageZoom=Extensión de página
ini_Normal=Tamaño de impresión basado en la imagen original DPI (es decir, crear una copia de tamaño real)
ini_FitToPage=Estirar la imagen para ajustar la página, respetando al mismo tiempo su proporción
ini_FitToPageStretch=Arrastrar la imagen para ajustar la página, ignorar la proporción
ini_FillPage=Extender la imagen para llenar toda la página (según su proporción)
ini_SpecifiedSize=Imprimir tamaño absoluto con parámetros de anchura absoluta y altura absoluta
ini_MultiplePages=Imprimir la imagen en más de una página con un número especificado de parámetros de anchura absoluta y altura absoluta
ini_SpecWidth=Anchura absoluta
ini_SpecHeight=Altura absoluta
ini_LoadPic=Cargar imagen
ini_ConfirmPrinting=Confirmar impresión




ini_PrintLog=diario de impresión
ini_Date=date
ini_Refresh=actualización
ini_OpenLogDirectory=abrir directorio de registro
ini_OpenOutputFileDirectory=abrir directorio de archivo de salida
ini_ViewCustomFile=ver el documento de definición propia
ini_LogList=diario
ini_LogContent=contenido del diario
ini_PdfFile=PDF
ini_Directory=Directory
ini_NotExist=no existe



ini_ReportDesign=Diseño de informes
ini_DoubleClickToOpenTheReportFile=Doble clic abre el archivo
ini_NewlyAdded=Adición
ini_Modify=Modificación
ini_Delete=Eliminar
ini_Copy=Copiar
ini_ReportDoesNotExist=No existe.
ini_To=Pasar a
ini_Error=Error
ini_InTheListBelow_selectTheReportFileYouWantToModify=Por favor seleccione el archivo de Estado que desea modificar en la lista que figura a continuación
ini_TestReport=Test statement
ini_AreYouSureYouWantToDelete=¿Está seguro de borrar?
ini_DeleteConfirmation=Borrar confirmación
ini_YouHaveChosenNotToDelete=Ha elegido no borrar
ini_ReportNameEn=Título del Estado financiero (en inglés)
ini_ReportNameAlias=Nombre del Estado financiero (alias)
ini_VersionNumber=Número de versión
ini_FileNameSuffixMustBe=El prefijo del archivo debe ser
ini_Currently=Por ahora
ini_TheFileNameAlreadyExists=El nombre del archivo ya existe
ini_ReportInfo=Información contable



ini_NoJsonFile=Archivo json
ini_PrintErrorJsonError=La impresión falló. Json tiene un formato incorrecto.
ini_MustBe=Debe ser
ini_Or=O
ini_ReportName=Título del informe
ini_CannotBeEmpty=No está vacío.
ini_MustBeIntOrFloat=Debe ser un número decimal o entero
ini_DeleteLocalReportFile=Borrar archivo local
ini_DownLoadReportFileToLocal=Descargar informes remotos a nivel local
ini_DownLoadReportFileError=Error al descargar el archivo
ini_DownLoadComplete=Descarga completa
ini_EditLocalReportVersion=Modificar el número de la versión local
ini_CreateReportFile=Crear archivo
ini_PrintCopys=Número de ejemplares impresos
ini_MustBeInt=Debe ser el tipo entero
ini_MustBeGreaterThanOrEqualTo=Debe ser superior a cero.
ini_DetermineIfThePrinterExists=Determinar si la impresora existe
ini_Printer=Impresora
ini_NotExistPayAttentionToCaseAndSpace=No existe. Por favor, tenga cuidado con el tamaño y el espacio.
ini_SetRightOffset=Establecer desviación derecha
ini_MustBeFloat=Tipo de coma flotante
ini_SetBottomOffset=Ajustar fondo
ini_MustBeOneOrZero=Debe ser uno o cero.
ini_SetComponent=Configuración de componentes
ini_Component=Caja de componentes
ini_ControlToArrayError=Control a array. Error.
ini_LoadPicError=Error al cargar la imagen
ini_FormatError=Error de forma
ini_Parameter=Parámetros
ini_ParameterToArrayError=Parameter, cambio a array.
ini_Field=Campo
ini_FieldToArrayError=Field a array. Error.
ini_AFieldToArrayError=Afield a array. Error.
ini_BFieldToArrayError=Bfield a array. Error.
ini_CFieldToArrayError=Cfield a array. Error.
ini_DFieldToArrayError=Dfield a array. Error.
ini_EFieldToArrayError=Efield a array. Error.
ini_FFieldToArrayError=Ffield a array. Error.
ini_GFieldToArrayError=Gfield a array. Error.
ini_HFieldToArrayError=Hfield a array. Error.
ini_IFieldToArrayError=Ifield a array. Error.
ini_JFieldToArrayError=Jfield a array. Error.
ini_DataRow=Línea de datos
ini_DataToArrayError=Data a array. Error.
ini_ADataToArrayError=ADATA a array. Error.
ini_BDataToArrayError=BData a array. Error.
ini_CDataToArrayError=CData a array. Error.
ini_DDataToArrayError=Ddata a array. Error.
ini_EDataToArrayError=EData a array. Error.
ini_FDataToArrayError=Fdata a array. Error.
ini_GDataToArrayError=GData a array. Error.
ini_HDataToArrayError=HData a array. Error.
ini_IDataToArrayError=IData a array. Error.
ini_JDataToArrayError=Jdata a array. Error.
ini_SetOffsetValue=Establecer valor de desviación
ini_SetPrinterName=Nombre de la impresora
ini_ExportFileYes=Exportar archivo es
ini_ExportFileName=Nombre del archivo
ini_ExportComplete=Salida completa.
ini_PreviewComplete=Vista preliminar completa
ini_PrintComplete=Imprimir vt.
ini_LoadReport=Cargar Declaración
ini_ADataToArraySuccess=ADATA se convirtió en Array.
ini_BDataToArraySuccess=BDATA se convirtió en Array.
ini_CDataToArraySuccess=CDATA se convirtió en Array.
ini_DDataToArraySuccess=DDATA se convirtió en Array.
ini_EDataToArraySuccess=EDATA se convirtió en Array.
ini_FDataToArraySuccess=FDATA se convirtió en Array.
ini_GDataToArraySuccess=GDATA se convirtió en Array.
ini_HDataToArraySuccess=HDATA se convirtió en Array.
ini_IDataToArraySuccess=IDATA se convirtió en Array.
ini_JDataToArraySuccess=GDATA se convirtió en Array.




ini_NoClientID=No hay valor para el cliente.
ini_ClientIDEmpty=El cliente no está vacío.
ini_PrinteridWrong=Printerid No.
ini_PrinterpwdWrong=Printerpwd No.
ini_MethodWrong=Method no tiene razón.
ini_PingSuccessful=Ping funcionó.
ini_PingTimeout=Tiempo libre
ini_ConnectionResults=Resultados de conexión
ini_subscribeResultMessageID=Resultado de la suscripción
ini_UnsubscribeResultMessageID=Cancelar suscripción, ID de mensaje
ini_Received_release_confirmation_QoS_1_message_ID=Recibido. Emisión confirmada. Qos - 1, ID.
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID=Recibido. Confirmación de emisión qos - 2. Paso 1, mensaje ID.
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID=Recibido. Confirmación de emisión qos - 2. Paso 3, mensaje ID.
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID=Recibido. Confirmación qos - 2. Paso 2, mensaje ID.
ini_ConnectionTimedOut=Tiempo de conexión
ini_PublishingTimeout=Tiempo fuera
ini_MessageID=ID de mensaje
ini_Topic=Tema
ini_Content=Contenido
ini_CameraOn=Cámara encendida.
ini_OpenFailed=Fallo de apertura
ini_NoVideoDevicesWereFound=No hay video
ini_Stopped=Se detuvo.
ini_CameraStartFailed=La Cámara falló.
ini_CameraOff=Cámara apagada.
ini_Disconnect=Desconecta la conexión.
ini_Started=Activado.
ini_Failed_to_start_Please_try_another_port=El arranque falló. Pruebe con otro puerto.
ini_Minimum_desktop_requirements_Windows_Vista=Windows Vista requisitos mínimos de Edición de escritorio
ini_Minimum_server_requirements_Windows_Server_2008=Servidor mínimo: Windows Server 2008





ini_Table_structure_field_type=Tipo de campo de estructura de tabla ftblob (formato de base 64), ftting ftinger ftboolean, ftfloat, ftcurrency, ftdatettime,
ini_size_ftString_ftInteger_ftBlob=Size (la longitud real se fija en ftstring, la otra en 0, por ejemplo ftinteleger ftblob, etc.) en 0)
ini_Currently_10_tables_are_supported=La tabla a contiene afield adata hasta que la tabla J contiene jfield jdata.





ini_ParameterSetting=Preferencias de parámetro
ini_Log_save_path_if_empty_the_default_is_log_directory=Ruta de registro (predeterminada como directorio log para espacios vacíos)
ini_Clear_log_on_startup=Limpiar el registro de inicio
ini_Clear_log_on_exit=Limpiar registro de salida
ini_In_operation_every=En marcha, cada XX minutos, vaciando.
ini_Save_settings=Guardar configuración
ini_journal=Diario
ini_report_form=Declaración
ini_Report_template_path_empty_default_report_directory=Ruta de plantillas de informes (para el directorio predeterminado de informes vacío)
ini_Export_file_path_empty_default_export_directory=Ruta de archivo exportada (para el directorio predeterminado de Export por aire)
ini_Export_file_format_blank_default_PDF_format=Exportar formato de archivo (para el formato predeterminado de PDF vacío)
ini_Enable_token=Activar Token
ini_Token_list_one_for_each_line_similar_to_white_list=Lista Token (una en la primera línea, como una lista blanca)
ini_other=Otros
ini_Minimize_after_startup=Minimización después del inicio
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients=Personalizar el nombre del cliente para permitirle iniciar múltiples clientes





ini_URL_encoding_decoding=Codificación / decodificación URL
ini_URLEncode=Código urlmenode
ini_URLDecode=Descifrado urldecode





ini_Base64_and_image_conversion=Base 64 y conversión de imágenes
ini_exceed_100k=Para equilibrar la eficiencia en el entorno de producción, los archivos de imagen individuales no deben superar los 100 K.
ini_Base64_string=Base 64
ini_paste=Pegar
ini_Turn_to_picture=Cambiar a imagen
ini_picture=Imagen





ini_Connection=Conexión
ini_write_log=Generar registro